#### TagOrientation Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing tag orientation options that are supported by IndependentTags.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public enum TagOrientation ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TagOrientation ``` |

| Visual C++ |
| --- |
| ``` public enum class TagOrientation ``` |

# Members

| Member name | Description |
| --- | --- |
| Horizontal | The Orientation of tag is Horizontal. |
| Vertical | The Orientation of tag is Vertical. |
| AnyModelDirection | The orientation of tag is Model. |

# See Also

Autodesk.Revit.DB Namespace